// #3ckURgvs
// – Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю або четверту частину години).

let time = +prompt('Введи число від 0 до 59');

if(time >= 0 && time <= 15) {
    console.log('Перша четверть');
} else if(time >= 16 && time <= 30) {
    console.log('Друга четверть');
}
else if(time >= 31 && time <= 45) {
    console.log('Третя четверть');
}
else if(time >= 46 && time <= 59) {
    console.log('Четверта четверть');
}
