// 1. Створити пустий масив та :

let arr = [];

//     a. заповнити його 50 парними числами за допомоги циклу.
let evenNumber = 2;
for (let i = 0; i < 50; i++){
    arr[i] = evenNumber;
    evenNumber = evenNumber + 2;
}
console.log(arr);

//     b. заповнити його 50 непарними числами за допомоги циклу.
let oddNumber = 1;
for (let i = arr.length; i < 100; i++){
    arr[i] = oddNumber;
    oddNumber = oddNumber + 2;
}
console.log(arr);

//     c. Заповнити масив 20-ма рандомними числами. (Google: Generate random number JS)

for (let i = arr.length; i < 120; i++){
    arr[i] = Math.floor(Math.random() * 100);
}
console.log(arr);

// d. Заповнити масив 20-ма рандомними числами в діапазоні від 8 до 732 (Google: Generate random number JS)

for (let i = arr.length; i < 140; i++){
    arr[i] = Math.floor(Math.random() * (732 - 8 + 1)) + 8;
}
console.log(arr);

// 2. Вивести за допомогою console.log кожен третій елемент
for (i = 2; i < arr.length; i = i + 3){
  console.log(arr[i]);
}

// 3. Вивести за допомогою console.log кожен третій елемент, тільки якщо цей елемент є парним.
//
// 4. Вивести за допомогою console.log кожен третій елемент, тільки якщо цей елемент є парним, та записати їх в новий масив
//
// 5. Вивести кожен елемент масиву, сусід справа якого є парним
//
// EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
//
// 6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//
//
//
// 7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//
// 8. Створити масив з будь-якими значеннями (стрінги, числа, і тд…). пройтись по ньому, і, якщо елемент є числом, додати його в інший масив.


